app/Controllers/Facebook.php

SELECT *
FROM `akun_facebook`
---
    public function index()
    {
        $data['facebook'] = $this->facebook->findAll();

INSERT INTO `akun_facebook` (`id_facebook`, `link_facebook`) VALUES ('FB004', 'https://facebook.com/tamtam')
---
    public function store()
    {
        // Validasi
        $rules = [
            'id_facebook' => [
                'rules' => 'required|is_unique[akun_facebook.id_facebook]|min_length[3]|max_length[20]',
                'errors' => [
                    'required' => 'ID Facebook harus diisi',
                    'is_unique' => 'ID Facebook sudah digunakan',
                    'min_length' => 'ID Facebook minimal 3 karakter',
                    'max_length' => 'ID Facebook maksimal 20 karakter'
                ]
            ],
            'link_facebook' => [
                'rules' => 'required|valid_url|max_length[255]',
                'errors' => [
                    'required' => 'Link Facebook harus diisi',
                    'valid_url' => 'Link Facebook tidak valid',
                    'max_length' => 'Link Facebook terlalu panjang'
                ]
            ]
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Simpan data
        $this->facebook->save([
            'id_facebook'   => $this->request->getPost('id_facebook'),
            'link_facebook' => $this->request->getPost('link_facebook'),
        ]);

UPDATE `akun_facebook` SET `link_facebook` = 'https://facebook.com/kimjaa'
WHERE `akun_facebook`.`id_facebook` IN ('FB001')
---
    public function update($id)
    {
        // Validasi
        $rules = [
            'link_facebook' => [
                'rules' => 'required|valid_url|max_length[255]',
                'errors' => [
                    'required' => 'Link Facebook harus diisi',
                    'valid_url' => 'Link Facebook tidak valid',
                    'max_length' => 'Link Facebook terlalu panjang'
                ]
            ]
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->facebook->update($id, [
            'link_facebook' => $this->request->getPost('link_facebook')
        ]);