app/Controllers/Home.php

    public function index()
    {
        // Load models
        $petugasModel = new PetugasModel();
        $jadwalModel = new JadwalModel();
        $progressModel = new ProgressModel();
        $instagramModel = new InstagramModel();
        $facebookModel = new FacebookModel();
        $tiktokModel = new TiktokModel();
        $emailModel = new EmailModel();
        $websiteModel = new WebsiteModel();
        $waModel = new WhatsappModel();

        // Data untuk statistik
        $data['total_petugas'] = $petugasModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `data_petugas`

        $data['jadwal_hari_ini'] = $jadwalModel->where('hari_jadwal', $hari_indonesia[$hari_ini])->countAllResults();

        // Jadwal terdekat - AMBIL SEMUA DULU
        $jadwal = $jadwalModel->select('jadwal_tugas.*, data_petugas.nama_petugas')
                              ->join('data_petugas', 'data_petugas.id_petugas = jadwal_tugas.id_petugas', 'left')
                              ->findAll();
---
SELECT `jadwal_tugas`.*, `data_petugas`.`nama_petugas`
FROM `jadwal_tugas`
LEFT JOIN `data_petugas` ON `data_petugas`.`id_petugas` = `jadwal_tugas`.`id_petugas`

        $data['jadwal_terdekat'] = array_slice($jadwal, 0, 5);

        // Total akun media sosial
        $data['total_instagram'] = $instagramModel->countAll();
        $data['total_facebook'] = $facebookModel->countAll();
        $data['total_tiktok'] = $tiktokModel->countAll();
        $data['total_email'] = $emailModel->countAll();
        $data['total_website'] = $websiteModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `akun_instagram`
SELECT COUNT(*) AS `numrows` FROM `akun_facebook`
SELECT COUNT(*) AS `numrows` FROM `akun_tiktok`
SELECT COUNT(*) AS `numrows` FROM `website`