app/Controllers/Instagram.php

    public function index()
    {
        $data['instagram'] = $this->instagram->findAll();
---
SELECT *
FROM `akun_instagram`