app/Controllers/Jadwal.php

SELECT *
FROM `data_petugas`
---
    public function index()
    {
        $data = [
            'jadwal' => $this->jadwal->getJadwalWithPetugas(),
            'petugas' => $this->petugas->findAll()