app/Controllers/Petugas.php

    public function index()
    {
        $data['petugas'] = $this->model->findAll();
---
SELECT *
FROM `data_petugas`