app/Controllers/Progress.php

    public function index()
    {
        $data = [
            'progress' => $this->progress->getProgressWithJadwal(),
            'petugas' => $this->petugas->findAll()
---
SELECT *
FROM `data_petugas`