app/Controllers/Tiktok.php

SELECT *
FROM `akun_tiktok`
---
    public function index()
    {
        $data['tiktok'] = $this->tiktok->findAll();