app/Controllers/Website.php

SELECT *
FROM `website`
---
    public function index()
    {
        $data['website'] = $this->website->findAll();