app/Models/JadwalModel.php

    public function getJadwalWithPetugas()
    {
        // Ambil data dari database dengan JOIN ke data_petugas
        $jadwal = $this->select('jadwal_tugas.*, data_petugas.nama_petugas') // <-- PERBAIKAN
                       ->join('data_petugas', 'data_petugas.id_petugas = jadwal_tugas.id_petugas', 'left') // <-- PERBAIKAN
                       ->findAll();
---
SELECT `jadwal_tugas`.*, `data_petugas`.`nama_petugas`
FROM `jadwal_tugas`
LEFT JOIN `data_petugas` ON `data_petugas`.`id_petugas` = `jadwal_tugas`.`id_petugas`