app/Models/ProgressModel.php

SELECT `progress_harian`.*, `jadwal_tugas`.`hari_jadwal`, `jadwal_tugas`.`jam_jadwal`, `data_petugas`.`nama_petugas`
FROM `progress_harian`
LEFT JOIN `jadwal_tugas` ON `jadwal_tugas`.`id_jadwal` = `progress_harian`.`id_jadwal`
LEFT JOIN `data_petugas` ON `data_petugas`.`id_petugas` = `jadwal_tugas`.`id_petugas`
ORDER BY `progress_harian`.`tanggal_progress` DESC, `jadwal_tugas`.`jam_jadwal` ASC
---
    public function getProgressWithJadwal()
    {
        return $this->select('progress_harian.*, jadwal_tugas.hari_jadwal, jadwal_tugas.jam_jadwal, data_petugas.nama_petugas')
                    ->join('jadwal_tugas', 'jadwal_tugas.id_jadwal = progress_harian.id_jadwal', 'left')
                    ->join('data_petugas', 'data_petugas.id_petugas = jadwal_tugas.id_petugas', 'left')
                    ->orderBy('progress_harian.tanggal_progress', 'DESC')
                    ->orderBy('jadwal_tugas.jam_jadwal', 'ASC')
                    ->findAll();